Revit 2024 API
CurveByPointsArray.Item Property
Gets or sets a curve at a specified index within the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual CurveByPoints this[
	int index
] { get; set; }
Visual Basic
Public Overridable Property Item ( _
	index As Integer _
) As CurveByPoints
	Get
	Set
Visual C++
public:
virtual property CurveByPoints^ Item[int index] {
	CurveByPoints^ get (int index);
	void set (int index, CurveByPoints^ value);
}
Parameters
index
Type: System.Int32
The index of the curve to be set or retrieved.
Return Value
Returns the curve at the specified index.
See Also
CurveByPointsArray Class
Autodesk.Revit.DB Namespace